
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>


//			// -----------------------------------------------------------------------------------
//		//	①	//    求最大值  $-$-$	求10个整数中最大值
//			// -----------------------------------------------------------------------------------
																								     //-
//int ams(int x, int y)			//定义函数  ams  返回  2个整数  中最大值
//{
//
//	if (x > y)
//		return x;
//	else
//	{
//		return y;
//	}
//}
//
//int main()
//{
//
//	int ann[10] = { -1,-2,-3,-45,0,-6,7,-8,-9,-10 };
//	int amx = ann[0];			//	定义  amx	存放返回的最大值 ，
//
//	int ams(int x, int y);
//	for (int i = 1; i < 10; i++)
//	{
//		amx = ams(amx, ann[i]);
//	}
//	printf("%d", amx);
//
//	return 0;
//}





//			// -----------------------------------------------------------------------------------
//		//	②	//    在屏幕上输出9 * 9乘法口诀表  &&	调用函数的次数
//			// -----------------------------------------------------------------------------------
                                                                                                     //-
//void lxl(int x,int*aoa)		 //	定义函数  lxl  打印9 * 9乘法口诀表	 ,指针  int*aoa  记录 调用函数的次数
//{
//	*aoa = *aoa + 1;
//	for (int i = 1;i < x + 1; i++)
//	{
//		if (x != i)
//		{
//			printf("%d*%d=%-2d\t", x, i, x * i);
//		}
//		else
//		{
//			printf("%d*%d=%-2d\n", x, i, x * i);
//		}
//	}
//}
//int main()
//{
//	 int aoa = 0;
//	void lxl(int x, int* aoa);
//	//int arr[] = { 1,2,3,4,5,6,7,8,9, };
//	for (int i = 1; i < 10; i++)
//	{
//		lxl(i,&aoa);
//	}
//	printf("每调用 lxl 函数%d次 \n",aoa);
//	return 0;
//}





//			// -----------------------------------------------------------------------------------
//		//	③	//    二分查找	  $-$-$		在一个有序数组  中  杳找具体的某个数
//			// -----------------------------------------------------------------------------------
                                                                                                        //-			
//int binary_search(int arr[] /*本质上arr是一个指针*/  , int k, int sz)	//定义函数   binary_search  实现二分查找
//                                                                     //如果找到了	返回这个数的下标	||    找不到的返回  -1
//	  				
//{
//	int left = 0;
//	int right = sz - 1;
//dddd:;
//	int mid = (left + right) / 2;//中间元素的下标
//		if (arr[mid]<k)
//		{
//			left = mid + 1;
//		}
//		else if (arr[mid]>k)
//		{
//			right = mid - 1;
//		}
//		else
//		{
//			return mid;
//		}
//		if (left>right)
//		{
//			return -1;
//		}
//		else
//		{
//			goto dddd;
//		}
//		
//}
//int main()
//{ 
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	int k = 76;
//	int ret=binary_search(arr /*传递过去的是数组arr首元素的地址*/ , k, sz);
//	if (ret==-1)
//	{
//		printf("找不到的返回");
//	}
//	else
//	{
//		printf("找到了，下标是: %d ",ret);
//
//	}
//	return 0;
//}









